{
    "projects": [
      {
        "id": 1,
        "image": "/images/project/bookzone.png",
        "link": "https://bookzone.io.vn",
        "techStack": ["NextJS", "Express", "MongoDB", "Vercel"],
        "i18n": {
          "en": {
            "title": "BookZone - The  Book Library",
            "description": "A free online library offering thousands of ebooks across diverse categories. Built to deliver a fast, secure, and engaging reading experience for all users, with continuous content updates and easy downloads."
          },
          "vi": {
            "title": "BookZone - Thư Viện Sách",
            "description": "Thư viện đọc sách trực tuyến miễn phí với hàng nghìn đầu sách thuộc nhiều thể loại. Giao diện thân thiện, tốc độ nhanh, cập nhật nội dung liên tục và hỗ trợ tải sách dễ dàng."
          }
        }
      },
      {
        "id": 2,
        "image": "/images/project/cozastore.png",
        "link": "https://gitlab.com/CozaStore-Finn",
        "techStack": ["Next.js", "TailwindCSS", "Express.js", "Node.js", "MongoDB"],
        "i18n": {
          "en": {
            "title": "COZA Store - Fashion E-commerce Website",
            "description": "A fully functional e-commerce project built with the MERN stack and TailwindCSS. Features include product browsing, category filters, product details, cart system, and responsive UI optimized for both desktop and mobile."
          },
          "vi": {
            "title": "COZA Store - Website Thương Mại Điện Tử Thời Trang",
            "description": "Dự án thương mại điện tử hoàn chỉnh xây dựng bằng MERN stack và TailwindCSS. Tích hợp đầy đủ tính năng như duyệt sản phẩm, lọc theo danh mục, chi tiết sản phẩm, giỏ hàng, giao diện responsive tối ưu cho cả desktop và mobile."
          }
        }
      },
      {
        "id": 3,
        "image": "/images/project/country-Api.png",
        "link": "https://country-api-mu-nine.vercel.app/",
        "stars": 7780,
        "techStack": ["ReactJS", "Styled Components", "HTML", "CSS"],
        "i18n": {
          "en": {
            "title": "Country Info Explorer",
            "description": "An interactive web app for exploring countries around the world by name or region. Ideal for learning API integration, working with JSON data, and building filterable UI with responsive design."
          },
          "vi": {
            "title": "Tra cứu thông tin quốc gia",
            "description": "Ứng dụng web cho phép tra cứu thông tin các quốc gia theo tên hoặc khu vực. Phù hợp để thực hành làm việc với API, dữ liệu JSON, và xây dựng giao diện lọc tương tác, responsive."
          }
        }
      },
      {
        "id": 4,
        "image": "/images/project/monafresh.png",
        "link": "https://127.0.0.1:5501/index.html",
        "techStack": ["HTML", "CSS", "JavaScript"],
        "i18n": {
          "en": {
            "title": "MonaFresh - Organic Food Shop",
            "description": "A static website project built with pure HTML, CSS, and JavaScript, simulating an online store for clean and organic food. Features product listings, category filters, cart buttons, and responsive design."
          },
          "vi": {
            "title": "MonaFresh - Cửa Hàng Thực Phẩm Sạch",
            "description": "Website tĩnh được xây dựng bằng HTML, CSS và JavaScript mô phỏng một cửa hàng thực phẩm sạch. Bao gồm danh mục sản phẩm, lọc theo loại, nút thêm giỏ hàng, và bố cục responsive thân thiện người dùng."
          }
        }
      }
    ]
  }